case_up_half_cube_10/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    left
    {
        type            symmetryPlane;
    }
    right
    {
        type            totalPressure;
//        rho             rho;
//        psi             none;
//        gamma           1;
        p0              uniform 101325;
        value           uniform 101325;
    }
    top
    {
        type            totalPressure;
//        rho             rho;
//        psi             none;
//        gamma           1;
        p0              uniform 101325;
        value           uniform 101325;
    }
    bottom
    {
        type            totalPressure;
//        rho             rho;
//        psi             none;
//        gamma           1;
        p0              uniform 101325;
        value           uniform 101325;
    }
    front
    {
        type            totalPressure;
//        rho             rho;
//        psi             none;
//        gamma           1;
        p0              uniform 101325;
        value           uniform 101325;
    }
    back
    {
        type            totalPressure;
//        rho             rho;
//        psi             none;
//        gamma           1;
        p0              uniform 101325;
        value           uniform 101325;
    }
    walls
    {
        type            zeroGradient;
//        type            fixedFluxPressure;
//        gradient        uniform 0;
//        value           uniform 101325;
    }
    source
    {
        type            zeroGradient;
    }
    nozzle_wall_rest
    {
        type            zeroGradient;
//        type            fixedFluxPressure;
//        gradient        uniform 0;
//        value           uniform 101325;
    }
}


// ************************************************************************* //
